Config/Catalogs/ИсточникиДанныхДляРасчетовБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИсточникиДанныхДляРасчетовБюджетирования</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаИсточникаДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДатыОтбораДанныхИсточника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДатаГраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДатыГраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальнаяГраницаОтсчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыГраницОтбораИсточникаПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачальнойГраницыОтсчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СдвигВПериодах</Name>
							<Comment>Сдвиг (в периодах планирования)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодСмещения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗначения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОстатковОборотовБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияИсточника</Name>
					<Comment>Измерения источника для возможного распределения значений ресурсов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзмерениеБюджетирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИзмеренияБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоляИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПоРегиструБюджетирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотовПоБюджетам</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиОборотовПоБюджетам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вычитать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПоРегиструБухгатерии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОборота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субк1Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субк2Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субк3Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубк1Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубк2Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубк3Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вычитать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ИсточникиДанныхДляРасчетовБюджетирования/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПолучитьСхемуКомпоновкиДанных()
	// инициализирует новую СКД и помещает во временное хранилище
	// устанавливает адрес временного хранилища схемы компоновки данных
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ЛокальнаяБаза";
	ИсточникДанных.СтрокаСоединения = "";
	ИсточникДанных.ТипИсточникаДанных= "Local";
	
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Запрос";
	НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
	НаборДанных.АвтоЗаполнениеДоступныхПолей=Истина;
	
	НаборДанных.Запрос =
	"ВЫБРАТЬ
	|*";
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Правило = ДанныеФормыВЗначение(Объект,Тип("СправочникОбъект.ИсточникиДанныхДляРасчетовБюджетирования"));
		СохраненнаяСхема = Правило.СхемаИсточникаДанных.Получить();
		СохраненныйКомпоновщикНастроек = Правило.КомпоновщикНастроек.Получить();
		
		Если СохраненнаяСхема = Неопределено Тогда
			ПолучитьСхемуКомпоновкиДанных();
			ИнициализироватьКомпоновщикСервер(Неопределено);
		Иначе
			СхемаКомпоновкиДанных = СохраненнаяСхема;
			АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
		КонецЕсли;
		
		ИнициализироватьКомпоновщикСервер(СохраненныйКомпоновщикНастроек);
	Иначе
		ИнициализироватьКомпоновщикСервер(Неопределено);
		// новый элемент 
		// для него нужно создать пустую СКД и получить адрес временного хранилища
//		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	КонецЕсли;
	
	
	//ИнициализироватьКомпоновщикСервер(Неопределено);
	//Если ТипЗнч(СхемаКомпоновкиДанных)=Тип("СхемаКомпоновкиДанных") Тогда
	//	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	//	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСхемуКомпоновки(Команда)
	ОткрытьКонструкторСхемыКомпоновкиДанных();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторСхемыКомпоновкиДанных()
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		// Настройки компоновщика настроек помещаются в редактируемую схему
		ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
		
		// Создается копия редактируемой схемы
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных)));
		
		// Копия редактируемой схемы открывается в конструкторе
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Для того, чтобы редактировать схему компоновки, необходимо запустить конфигурацию в режиме толстого клиента.'"));
		
	#КонецЕсли
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных)
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	КомпоновкаДанныхКлиентСервер.ОчиститьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновкаДанныхКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, КомпоновщикНастроек.Настройки);
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьИспользованиеПараметра(СКД,ИмяПараметра,Использование)
	 Параметр = СКД.НастройкиПоУмолчанию.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	 Если Параметр <> Неопределено Тогда
		Параметр.Использование = Использование;
	 КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Структуру отчета пересоздаем во избежание ошибок
	// если ее забыли создать млм создали не так как нужно
	
	СтруктураОтчета = ВыбранноеЗначение.НастройкиПоУмолчанию.Структура;
	СтруктураОтчета.Очистить();
	
	ГруппировкаДетальныхЗаписей = СтруктураОтчета.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДетальныхЗаписей.Имя = "ДетальныеЗаписиБюджетирования";
	ГруппировкаДетальныхЗаписей.Использование = Истина;
	
	АвтоПоле = ГруппировкаДетальныхЗаписей.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	// отключим итоги по вертикали
	ИтогиПоВертикали = ВыбранноеЗначение.НастройкиПоУмолчанию.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов");
	Если ИтогиПоВертикали <> Неопределено Тогда
		ИтогиПоВертикали.Значение = РасположениеИтоговКомпоновкиДанных.Нет;
		ИтогиПоВертикали.Использование = Истина;
	КонецЕсли;	
	
	// установим использование у параметоров периода
	УстановитьИспользованиеПараметра(ВыбранноеЗначение,"НачалоПериода",Истина);
	УстановитьИспользованиеПараметра(ВыбранноеЗначение,"КонецПериода",Истина);
	
	ПоместитьВоВременноеХранилище(ВыбранноеЗначение,АдресСхемыКомпоновкиДанных);
	// тут можно выбрать все доступные поля из СКД
	ИнициализироватьКомпоновщикСервер(Неопределено);
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	Для Каждого ДоступноеПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если ДоступноеПоле.Папка Тогда
			ПродолжитЬ;
		КонецЕсли;	
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок = ДоступноеПоле.Заголовок;
		НовоеПоле.Поле = ДоступноеПоле.Поле;
		НовоеПоле.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// скопируем настройки из компоновщика настроек в СКД
	ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
	// сохраним СКД в хранилище
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	ТекущийОбъект.СхемаИсточникаДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
	// сохраним настройки компановщика в хранилище
	ТекущийОбъект.КомпоновщикНастроек = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	СохраненныйКомпоновщикНастроек = ТекущийОбъект.КомпоновщикНастроек.Получить();
	ИнициализироватьКомпоновщикСервер(СохраненныйКомпоновщикНастроек);
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикСервер(НастройкаКомпоновки)
	Если Не ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда
		ПолучитьСхемуКомпоновкиДанных();
	КонецЕсли;
	
	Попытка
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
					УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
	Если НастройкаКомпоновки = Неопределено Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкаКомпоновки);
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

// проверка результата работы источника данных
&НаСервере
Процедура ПроверитьРезультатНаСервере(ДокументРезультат)
	СКД = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	// подготовим макет 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.ПолучитьНастройки());
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	ПроцессорКомпоновки.Сбросить();
	
	// выведем результат                                                             
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРезультат(Команда)
	ДокументРезультат = Новый ТабличныйДокумент;
	ПроверитьРезультатНаСервере(ДокументРезультат);
	ДокументРезультат.Показать();
КонецПроцедуры

&НаСервере
Процедура ПроверитьРезультатНаСервереВТЗ()
	СКД = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	// подготовим макет 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	ПроцессорКомпоновки.Сбросить();
	
	// выведем результат       
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		// что то не работает ну и не очень хотелось в отладчике можно таблицу поймать
		ТЗ.ВыбратьСтроку();
	#КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьРезультатВТЗ(Команда)
	ПроверитьРезультатНаСервереВТЗ();
КонецПроцедуры

#Область КонструкторЗапроса
// конструктор запроса для совместимости со старыми статьями
&НаКлиенте
Процедура ОткрытьКонтструкторЗапроса(Команда)
	Конструктор = Новый КонструкторЗапроса;
	Если ЗначениеЗаполнено(Объект.ТекстЗапроса) Тогда
		Конструктор.Текст = Объект.ТекстЗапроса; 
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗапросаЗавершение",ЭтаФорма); 
	Конструктор.Показать(Оповещение); 
КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьКонструкторЗапросаЗавершение(Текст, ДополнительныеПараметры) Экспорт 
	Если НЕ Текст = Неопределено Тогда 
		Объект.ТекстЗапроса = Текст; 
	КонецЕсли; 
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьЗапросВСКД(Команда)
	ОткрытьКонструкторСхемыКомпоновкиДанныхПоЗапросу();
КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьКонструкторСхемыКомпоновкиДанныхПоЗапросу()
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		// Настройки компоновщика настроек помещаются в редактируемую схему
		//ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
		
		// Создается копия редактируемой схемы
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных)));
		НаборДанных = СхемаКомпоновкиДанных.НаборыДанных[0];
		НаборДанных.Имя = "Запрос";
		НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
		НаборДанных.АвтоЗаполнениеДоступныхПолей=Истина;
		НаборДанных.Запрос = Объект.ТекстЗапроса;

		// Копия редактируемой схемы открывается в конструкторе
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Для того, чтобы редактировать схему компоновки, необходимо запустить конфигурацию в режиме толстого клиента.'"));
		
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьЗапросПоРегистру(Команда)
	СгенерироватьЗапросПоНастройкамРегНакопленияДляИсточника();
КонецПроцедуры


&НаСЕрвере
Процедура СгенерироватьЗапросПоНастройкамРегНакопленияДляИсточника()
	
	номПараметра = 1;
	
	тНачалоШапки = "ВЫБРАТЬ ";                               
	тРезультат = "";
	тЗапроса   = "";
	тКонецШапки = " КАК Сумма,";                         
	
	// если нет строк настройки тогда просто возвращаемся
	Если Объект.НастройкиПоРегиструБюджетирования.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого ВыборкаСтроки Из Объект.НастройкиПоРегиструБюджетирования Цикл
		
		Вычитать = ВыборкаСтроки.Вычитать;
		КолСтрок = Объект.НастройкиПоРегиструБюджетирования.Количество();
		
		имяПараметрСтатья = "СтатьяОборотов" + Строка(номПараметра);
		имяПараметрСценарий = "Сценарий" + Строка(номПараметра);
		
		СтруктураПараметров.Вставить(имяПараметрСтатья,ВыборкаСтроки.СтатьяОборотовПоБюджетам);  // проставить знаяение
		СтруктураПараметров.Вставить(имяПараметрСценарий,ВыборкаСтроки.Сценарий);// проставить знаяение
		
		Если ВыборкаСтроки.СтатьяОборотовПоБюджетам.ЭтоГруппа Тогда
//			СтрокаОтбора =   "СтатьяОборотов В ИЕРАРХИИ (&" + имяПараметрСтатья + ")" + ?(ЗначениеЗаполнено(ВыборкаСтроки.Сценарий), " И Сценарий = &" + имяПараметрСценарий,"");
			СтрокаОтбора =   "СтатьяОборотов В ИЕРАРХИИ (&" + имяПараметрСтатья + ")" + " И Сценарий = &" + имяПараметрСценарий;
		Иначе
//			СтрокаОтбора =   "СтатьяОборотов = &" + имяПараметрСтатья + ?(ЗначениеЗаполнено(ВыборкаСтроки.Сценарий), " И Сценарий = &" + имяПараметрСценарий,"");
			СтрокаОтбора =   "СтатьяОборотов = &" + имяПараметрСтатья + " И Сценарий = &" + имяПараметрСценарий;
		КонецЕсли;

		Если КолСтрок = 1 Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	СУММА(ОборотыБюджетовОбороты.СуммаУпрОборот) КАК Сумма,
			|	ОборотыБюджетовОбороты.Период
			|ИЗ
			|	РегистрНакопления.ОборотыБюджетов.Обороты(&НачалоПериода, &КонецПериода, День, " + СтрокаОтбора + ") КАК ОборотыБюджетовОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	ОборотыБюджетовОбороты.Период"
			
		Иначе
			
			Собираем = (КолСтрок = номПараметра);
			
			тРезультат = тРезультат + " ВложенныйЗапрос"+Строка(номПараметра)+ ".Сумма"+Строка(номПараметра)+ ?(Собираем,"",?(Вычитать," - "," + "));
			
			тЗапроса = тЗапроса + 
			"(ВЫБРАТЬ
		    |ЕСТЬNULL(СУММА(ОборотыБюджетовОбороты.СуммаУпрОборот), 0) КАК Сумма" + Строка(номПараметра) + " 
			|ИЗ
		    |РегистрНакопления.ОборотыБюджетов.Обороты(&НачалоПериода,&КонецПериода,," +СтрокаОтбора+ ") КАК ОборотыБюджетовОбороты) КАК ВложенныйЗапрос" + Строка(номПараметра)+ ?(Собираем,"",",") + Символы.ПС ;
			
			Если Собираем Тогда //Собираем                                                                                                                               
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|" + тРезультат + тКонецШапки + Символы.ПС +
				"&КонецПериода КАК Период
				|ИЗ" + Символы.ПС +
				""+ тЗапроса;
			КонецЕсли;	
			
		КонецЕсли;
		
		номПараметра = номПараметра + 1;
		
	КонецЦикла;
	
	Объект.ТекстЗапроса = ТекстЗапроса;
	
	// Создание СКД
	СоздатьСКДПоЗапросуИПараметрам(СтруктураПараметров);
КонецПроцедуры	

&НаСервере
Процедура СоздатьСКДПоЗапросуИПараметрам(СтруктураПараметров)
		// Создание СКД
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ЛокальнаяБаза";
	ИсточникДанных.СтрокаСоединения = "";
	ИсточникДанных.ТипИсточникаДанных= "Local";
	
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Запрос";
	НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
	
	НаборДанных.Запрос = Объект.ТекстЗапроса;
	НаборДанных.АвтоЗаполнениеДоступныхПолей=Истина;
	
	НовыйРесурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	НовыйРесурс.ПутьКДанным = "Сумма";
	НовыйРесурс.Выражение   = "Сумма(Сумма)";

	СхемаКомпоновкиДанных.Параметры.Очистить();
	
    ПараметрДанных               = СхемаКомпоновкиДанных.Параметры.Добавить();
    ПараметрДанных.Имя           = "НачалоПериода";
    ПараметрДанных.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
    ПараметрДанных.Заголовок     = "Начало периода";
    ПараметрДанных.ВключатьВДоступныеПоля = Истина;
    
    ПараметрДанных               = СхемаКомпоновкиДанных.Параметры.Добавить();
    ПараметрДанных.Имя           = "КонецПериода";
    ПараметрДанных.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
    ПараметрДанных.Заголовок     = "Конец периода";
    ПараметрДанных.ВключатьВДоступныеПоля = Истина;
	
	
	Для Каждого ПараметрИсточника Из СтруктураПараметров Цикл
		ПараметрДанных = СхемаКомпоновкиДанных.Параметры.Добавить();
		ПараметрДанных.Имя = ПараметрИсточника.Ключ;
		ПараметрДанных.Значение = ПараметрИсточника.Значение;
 	    ПараметрДанных.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрДанных.ОграничениеИспользования = Ложь;
	КонецЦикла;	
	
	
	СтруктураОтчета = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Структура;
	СтруктураОтчета.Очистить();
	
	ГруппировкаДетальныхЗаписей = СтруктураОтчета.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДетальныхЗаписей.Имя = "ДетальныеЗаписиБюджетирования";
	ГруппировкаДетальныхЗаписей.Использование = Истина;
	
	АвтоПоле = ГруппировкаДетальныхЗаписей.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,АдресСхемыКомпоновкиДанных);

КонецПроцедуры


&НаКлиенте
Процедура СгенерироватьЗапросПоРегиструБухгалтерии(Команда)
	СгенерироватьЗапросПоНастройкамРегистраБухгалтерии();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоСчетГруппа(Счет)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Родитель = &Родитель";

	Запрос.УстановитьПараметр("Родитель", Счет);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат(Истина);
	Иначе	
		Возврат(Ложь);
	КонецЕсли;

КонецФункции	


&НаСервере
Процедура СгенерироватьЗапросПоНастройкамРегистраБухгалтерии() 
		номПараметра = 1;
		
		тНачалоШапки = "ВЫБРАТЬ ";
		тРезультат = "";
		тЗапроса   = "";
		ТекстЗапроса = "";
		тКонецШапки = " КАК Сумма,";                         

		//СтатьяБюджета = Выборка.Ссылка;       
		
		//НастройкиИсточника = СтатьяБюджета.ХранилищеНастроек.Получить();
		//
		//Если НастройкиИсточника = Неопределено Тогда
		//	Возврат;
		//КонецЕсли;	

		СтруктураПараметров = Новый Структура;
		Для Каждого ВыборкаСтроки Из Объект.НастройкиПоРегиструБухгатерии Цикл
			
			//                                                   
//			Счет = ВыборкаСтроки.Счет;    //ЮЦАУ // Закрыл при переходе на УАТ
//			имяСчет = ПланыСчетов.Хозрасчетный.ПолучитьИмяПредопределенного(Счет); 
//            КорСчет = ВыборкаСтроки.КорСчет;
//			имяКорСчет = ПланыСчетов.Хозрасчетный.ПолучитьИмяПредопределенного(КорСчет);
//			
//			Если имяСчет <> "" Тогда
//				Если ЭтоСчетГруппа(Счет) Тогда
//					ОтборСчета = "Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный." + имяСчет + "))";
//				Иначе
//					ОтборСчета = "Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный." + имяСчет + ")";
//				КонецЕсли;
//			Иначе
//				ЗначениеСчет = ПланыСчетов.Хозрасчетный.НайтиПоКоду(Счет.Код);
//				Если (ЗначениеСчет <> Неопределено) и (ЗначениеСчет <> ПланыСчетов.Хозрасчетный.ПустаяССылка())Тогда
//					имяПараметраСчет = "счет" + Строка(номПараметра)+ "_" + СтрЗаменить(Счет.Код,".","_");
//					Если ЭтоСчетГруппа(Счет) Тогда
//						ОтборСчета = "Счет В ИЕРАРХИИ(&" + имяПараметраСчет + ")";
//					Иначе
//						ОтборСчета = "Счет = &" + имяПараметраСчет;
//					КонецЕсли;
//					СтруктураПараметров.Вставить(имяПараметраСчет,ЗначениеСчет);
//				Иначе
//					ОтборСчета = "";
//				КонецЕсли;
//			КонецЕсли;
//			
//			Если имяКорСчет <> "" Тогда
//				Если ЭтоСчетГруппа(КорСчет) Тогда
//					ОтборКорСчета = "КорСчет В ИЕРАРХИИ  (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный." + имяКорСчет + "))";
//				Иначе
//					ОтборКорСчета = "КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный." + имяКорСчет + ")";
//				КонецЕсли;
//			Иначе
//				ЗначениеКорСчет = ПланыСчетов.Хозрасчетный.НайтиПоКоду(КорСчет.Код);
//				Если (ЗначениеКорСчет <> Неопределено) И (ЗначениеКорСчет <> ПланыСчетов.Хозрасчетный.ПустаяССылка())Тогда
//					имяПараметраКорСчет = "счет" + Строка(номПараметра)+ "_" + СтрЗаменить(КорСчет.Код,".","_"); 
//					Если ЭтоСчетГруппа(КорСчет) Тогда
//						ОтборКорСчета = "КорСчет В ИЕРАРХИИ (&" + имяПараметраКорСчет + ")";
//					Иначе
//						ОтборКорСчета = "КорСчет = &" + имяПараметраКорСчет;
//					КонецЕсли;
//					СтруктураПараметров.Вставить(имяПараметраКорСчет,ЗначениеКорСчет);
//				Иначе
//					ОтборКорСчета  = "";
//				КонецЕсли;
//			КонецЕсли;
//            //
//			Дебет  = ВыборкаСтроки.ВидОборота=Ложь;
//			Кредит = ВыборкаСтроки.ВидОборота=Истина;
//			
//			//Дебет = ВыборкаСтроки.Дебет;			
//			//Кредит = ВыборкаСтроки.Кредит;
//			Если Дебет Тогда
//				стрОборота = "СуммаОборотДт";
//			Иначе
//				стрОборота = "СуммаОборотКт";
//			КонецЕсли;	
//			//
//			ОтборПодразделение = "";
//			Подразделение = ВыборкаСтроки.Подразделение;
//			
//            //
//			СтрокаОтбораСубконто = "";
//			
//			ОписаниеСчета = ПолучитьСвойстваСчета(Счет);

//			Для НомерСубконто = 1 По ОписаниеСчета.КоличествоСубконто Цикл
////			Для Каждого счВидСубконто Из Счет.ВидыСубконто.Выгрузить() Цикл
//				//Если счВидСубконто.ВидСубконто = ВыборкаСтроки["ВидСубконто"+счВидСубконто.НомерСтроки] Тогда
//					
//				//	НомерСубконто = счВидСубконто.НомерСтроки;
//				//	имяПараметра = "с" + Строка(номПараметра) + "_"+ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПолучитьИмяПредопределенного(счВидСубконто.ВидСубконто);
//					имяПараметра = "с" + Строка(номПараметра) + "_"+ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПолучитьИмяПредопределенного(ОписаниеСчета["ВидСубконто"+НомерСубконто]);
//					
//					Если ТипЗнч(ВыборкаСтроки["Субконто"+НомерСубконто]) <> Тип("СписокЗначений") Тогда
//						
//						Если ВыборкаСтроки["Субконто"+НомерСубконто] <> Неопределено Тогда 
//							Если НЕ ВыборкаСтроки["Субконто"+НомерСубконто].Пустая() Тогда
//								Если СтрокаОтбораСубконто = "" Тогда
//									Если ВыборкаСтроки["Субк"+НомерСубконто+"Условие"] Тогда
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + "Субконто"+Строка(НомерСубконто)+" <> &"+имяПараметра;
//									Иначе
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + "Субконто"+Строка(НомерСубконто)+" = &"+имяПараметра;
//									КонецЕсли;
//								Иначе
//									Если ВыборкаСтроки["Субк"+НомерСубконто+"Условие"] Тогда
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И Субконто"+Строка(НомерСубконто)+" <> &"+имяПараметра;
//									Иначе
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И Субконто"+Строка(НомерСубконто)+" = &"+имяПараметра;
//									КонецЕсли;
//								КонецЕсли;
//								ЗначениеСубконто = ВыборкаСтроки["Субконто"+НомерСубконто];
//								СтруктураПараметров.Вставить(имяПараметра,ЗначениеСубконто);
//							КонецЕсли;
//						КонецЕсли;
//						
//					Иначе  // Список значений
//						
//						индСписка = 1;
//						
//						Для Каждого знчСписка Из ВыборкаСтроки["ЗначениеСубконто"+НомерСубконто] Цикл
//							
//							имяПараметраСп = имяПараметра + "Сп" + Строка(индСписка);
//							
//							Если СтрокаОтбораСубконто = "" Тогда
//								Если ВыборкаСтроки["Субк"+НомерСубконто+"Условие"] Тогда
//									СтрокаОтбораСубконто = СтрокаОтбораСубконто + "(Субконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
//								Иначе
//									СтрокаОтбораСубконто = СтрокаОтбораСубконто + "(Субконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
//								КонецЕсли;
//							Иначе
//								Если ВыборкаСтроки["Субк"+НомерСубконто+"Условие"] Тогда
//									Если индСписка = 1 Тогда
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И (Субконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
//									Иначе
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И Субконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
//									КонецЕсли;
//								Иначе
//									Если индСписка = 1 Тогда
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И (Субконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
//									Иначе
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " ИЛИ Субконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
//									КонецЕсли;
//								КонецЕсли;
//							КонецЕсли;
//							
//							ЗначениеСубконто = знчСписка.Значение;
//							СтруктураПараметров.Вставить(имяПараметраСп,ЗначениеСубконто);
//							
//							индСписка = индСписка + 1;
//							
//						КонецЦикла;	
//						СтрокаОтбораСубконто = СтрокаОтбораСубконто + ")";
//						
//					КонецЕсли;
					
				//КонецЕсли;	
			//КонецЦикла;
			
			
//			ОписаниеКорСчета = ПолучитьСвойстваСчета(КорСчет);

//			Для НомерКорСубконто = 1 По ОписаниеКорСчета.КоличествоСубконто Цикл
////			Для Каждого счВидСубконто Из КорСчет.ВидыСубконто.Выгрузить() Цикл
//				//Если счВидСубконто.ВидСубконто = ВыборкаСтроки["ВидКорСубконто"+счВидСубконто.НомерСтроки] Тогда
//					
//				//	НомерСубконто = счВидСубконто.НомерСтроки;
//					имяПараметра = "к" + Строка(номПараметра) + "_"+ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПолучитьИмяПредопределенного(ОписаниеКорСчета["ВидСубконто"+НомерКорСубконто]);
//					
//					Если ТипЗнч(ВыборкаСтроки["КорСубконто"+НомерКорСубконто]) <> Тип("СписокЗначений") Тогда
//						
//						Если ВыборкаСтроки["КорСубконто"+НомерКорСубконто] <> Неопределено Тогда 
//							Если НЕ ВыборкаСтроки["КорСубконто"+НомерКорСубконто].Пустая() Тогда
//								Если СтрокаОтбораСубконто = "" Тогда
//									Если ВыборкаСтроки["КорСубк"+НомерКорСубконто+"Условие"] Тогда
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + "КорСубконто"+Строка(НомерКорСубконто)+" <> &"+имяПараметра;
//									Иначе
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + "КорСубконто"+Строка(НомерКорСубконто)+" = &"+имяПараметра;
//									КонецЕсли;
//								Иначе
//									Если ВыборкаСтроки["КорСубк"+НомерКорСубконто+"Условие"] Тогда
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И КорСубконто"+Строка(НомерКорСубконто)+" <> &"+имяПараметра;
//									Иначе
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И КорСубконто"+Строка(НомерКорСубконто)+" = &"+имяПараметра;
//									КонецЕсли;
//								КонецЕсли;
//								ЗначениеКорСубконто = ВыборкаСтроки["КорСубконто"+НомерКорСубконто];
//								СтруктураПараметров.Вставить(имяПараметра,ЗначениеКорСубконто);
//							КонецЕсли;
//						КонецЕсли;
//						
//					Иначе  // Список значений
//						
//						индСписка = 1;
//						
//						Для Каждого знчСписка Из ВыборкаСтроки["КорСубконто"+НомерКорСубконто] Цикл
//							
//							имяПараметраСп = имяПараметра + "Сп" + Строка(индСписка);
//							
//							Если СтрокаОтбораСубконто = "" Тогда
//								Если ВыборкаСтроки["КорСубк"+НомерСубконто+"Условие"] Тогда
//									СтрокаОтбораСубконто = СтрокаОтбораСубконто + "(КорСубконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
//								Иначе
//									СтрокаОтбораСубконто = СтрокаОтбораСубконто + "(КорСубконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
//								КонецЕсли;
//							Иначе
//								Если ВыборкаСтроки["КорСубк"+НомерСубконто+"Условие"] Тогда
//									Если индСписка = 1 Тогда
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И (КорСубконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
//									Иначе
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И КорСубконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
//									КонецЕсли;
//								Иначе
//									Если индСписка = 1 Тогда
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И (КорСубконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
//									Иначе
//										СтрокаОтбораСубконто = СтрокаОтбораСубконто + " ИЛИ КорСубконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
//									КонецЕсли;
//								КонецЕсли;
//							КонецЕсли;
//							
//							ЗначениеСубконто = знчСписка.Значение;
//							СтруктураПараметров.Вставить(имяПараметраСп,ЗначениеСубконто);
//							
//							индСписка = индСписка + 1;
//							
//						КонецЦикла;	
//						СтрокаОтбораСубконто = СтрокаОтбораСубконто + ")";
//						
//					КонецЕсли;
//					
//				//КонецЕсли;	
//			КонецЦикла;

//			Если Подразделение <> Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
//				Если СтрокаОтбораСубконто = "" Тогда
//					ОтборПодразделение = " Подразделение = &Подразделение" + Строка(номПараметра); 
//				Иначе
//					ОтборПодразделение = " И Подразделение = &Подразделение" + Строка(номПараметра); 
//				КонецЕсли;
//				СтруктураПараметров.Вставить("Подразделение"+ Строка(номПараметра),Подразделение);
//			Иначе
//				ОтборПодразделение = "";
//			КонецЕсли;

//			
//			Вычитать = ВыборкаСтроки.Вычитать;
//			КолСтрок = Объект.НастройкиПоРегиструБухгатерии.Количество();
//			Если КолСтрок = 1 Тогда
//				
//				ТекстЗапроса = 
//				"ВЫБРАТЬ
//				|	ЕСТЬNULL(СУММА(ХозрасчетныйОбороты."+стрОборота+"),0) КАК Сумма,
//				|	ХозрасчетныйОбороты.Период
//				|ИЗ
//				|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, День,"+ОтборСчета+", , "+СтрокаОтбораСубконто+ОтборПодразделение + ","+ОтборКорСчета+",) КАК ХозрасчетныйОбороты
//				|СГРУППИРОВАТЬ ПО
//	            |ХозрасчетныйОбороты.Период";
//			Иначе
//				
//				Собираем = (КолСтрок = номПараметра);
//								
//				тРезультат = тРезультат + " Обороты"+Строка(номПараметра)+ ".Сумма"+Строка(номПараметра)+ ?(Собираем,"",?(Вычитать," - "," + "));
//								
//				тЗапроса = тЗапроса + 
//				"(ВЫБРАТЬ
//				|	ЕСТЬNULL(СУММА(ХозрасчетныйОбороты."+стрОборота+"),0) КАК Сумма"+Строка(номПараметра)+"
//				|ИЗ
//				|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ,"+ОтборСчета+", , "+СтрокаОтбораСубконто+ОтборПодразделение + ","+ОтборКорСчета+",) КАК ХозрасчетныйОбороты) КАК Обороты"+Строка(номПараметра)+ ?(Собираем,"",",") + Символы.ПС ;
//				
//				Если Собираем Тогда //Собираем                                                                                                                               
//					ТекстЗапроса = 
//					"ВЫБРАТЬ
//					|" + тРезультат + тКонецШапки + Символы.ПС +
//				   "&КонецПериода КАК Период
//				    |ИЗ" + Символы.ПС +
//				   ""+ тЗапроса;
//				КонецЕсли;	
//				
//			КонецЕсли;
//			
//			номПараметра = номПараметра + 1;
			
		КонецЦикла;
		
		Объект.ТекстЗапроса = ТекстЗапроса;
		// Создаем СКД
		СоздатьСКДПоЗапросуИПараметрам(СтруктураПараметров);
		//НастройкиПостроителя.Вставить("ПараметрыПостроителя",ПараметрыПостроителя);
		//
		//обИсточник.НастройкиПостроителя = Новый ХранилищеЗначения(НастройкиПостроителя, Новый СжатиеДанных());
		//обИсточник.ПроизвольныйЗапрос = Истина;
		//
		//обИсточник.ТекстЗапроса = ТекстЗапроса; 
		//
		//Показатели = обИсточник.Показатели;
		//Показатели.Очистить();
		//нСтрока=Показатели.Добавить();
		//нСтрока.Имя="Сумма";
		//нСтрока.Представление="Сумма";
		//нСтрока.Использование=Истина;
		//
		//ДатыОтбораДанныхИсточника = обИсточник.ДатыОтбораДанныхИсточника;
		//ДатыОтбораДанныхИсточника.Очистить();
		//нСтрока = ДатыОтбораДанныхИсточника.Добавить();
		//нСтрока.ИмяДатаГраницы = "НачалоПериода";
		//нСтрока.ПредставлениеДатыГраницы = "Дата начала периода";
		//нСтрока.НачальнаяГраницаОтсчета	= Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода;
		//
		//нСтрока = ДатыОтбораДанныхИсточника.Добавить();
		//нСтрока.ИмяДатаГраницы = "КонецПериода";
		//нСтрока.ПредставлениеДатыГраницы = "Дата конца периода";
		//нСтрока.НачальнаяГраницаОтсчета	= Перечисления.ВидыГраницОтбораИсточникаПланирования.КонецПериода;
		//
		//обИсточник.Записать();
		//
		//Сообщить ("Запрос записан.");
		////Прервать;


КонецПроцедуры	


&НаСервереБезКонтекста
Функция ПолучитьСвойстваСчета(Знач Счет) Экспорт
	
	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("Ссылка"                         , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	ДанныеСчета.Вставить("Наименование"                   , "");
	ДанныеСчета.Вставить("Код"                            , "");
	ДанныеСчета.Вставить("КодБыстрогоВыбора"              , "");
	ДанныеСчета.Вставить("Родитель"                       , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	ДанныеСчета.Вставить("Вид"                            , Неопределено);
	ДанныеСчета.Вставить("Забалансовый"                   , Ложь);
	ДанныеСчета.Вставить("ЗапретитьИспользоватьВПроводках", Ложь);
	ДанныеСчета.Вставить("Валютный"                       , Ложь);
	ДанныеСчета.Вставить("Количественный"                 , Ложь);
	ДанныеСчета.Вставить("УчетПоПодразделениям"           , Ложь);
	ДанныеСчета.Вставить("НалоговыйУчет"                  , Ложь);
	ДанныеСчета.Вставить("КоличествоСубконто"             , 0);
	
	МаксКоличествоСубконто = 3;
	
	Для ИндексСубконто = 1 По МаксКоличествоСубконто Цикл
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      Ложь);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", Ложь);
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		Возврат ДанныеСчета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", Счет);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка,
	|	Хозрасчетный.Родитель,
	|	Хозрасчетный.Код,
	|	Хозрасчетный.КодБыстрогоВыбора,
	|	Хозрасчетный.Наименование,
	|	Хозрасчетный.Вид,
	|	Хозрасчетный.Забалансовый,
	|	Хозрасчетный.ЗапретитьИспользоватьВПроводках,
	|	Хозрасчетный.Валютный,
	|	Хозрасчетный.Количественный,
	|	Хозрасчетный.УчетПоПодразделениям,
	|	Хозрасчетный.НалоговыйУчет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка = &Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.НомерСтроки КАК НомерСтроки,
	|	ХозрасчетныйВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.Наименование КАК Наименование,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.ТипЗначения КАК ТипЗначения,
	|	ХозрасчетныйВидыСубконто.ТолькоОбороты КАК ТолькоОбороты,
	|	ХозрасчетныйВидыСубконто.Суммовой КАК Суммовой
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХозрасчетныйВидыСубконто.НомерСтроки";
	
	МассивРезультатов	= Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСчета, Выборка);
	КонецЕсли;
	
	ВыборкаВидыСубконто	= МассивРезультатов[1].Выбрать();
	
	ДанныеСчета.КоличествоСубконто	= ВыборкаВидыСубконто.Количество();
	
	ИндексСубконто	= 0;
	
	Пока ВыборкаВидыСубконто.Следующий() Цикл
		
		ИндексСубконто	= ИндексСубконто + 1;
		
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   ВыборкаВидыСубконто.ВидСубконто);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  ВыборкаВидыСубконто.Наименование);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   ВыборкаВидыСубконто.ТипЗначения);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      ВыборкаВидыСубконто.Суммовой);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", ВыборкаВидыСубконто.ТолькоОбороты);
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеСчета);
	
КонецФункции

&НаСервере
Процедура СчетПриИзмененииНаСервере(ИмяЭлемента)
		//ВидыСубконто = Элемент.Значение.ВидыСубконто.Выгрузить();
		//
		//Если ВидыСубконто.Количество() = 0 Тогда
		//	Для а = 1 По 3 Цикл
		//		Если ЭлементыФормы.НастройкиИсточника.ТекущаяКолонка.Имя = "Счет" Тогда
		//			ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ЗначениеСубконто" + Строка(а)] = Неопределено;
		//			ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ВидСубконто" + Строка(а)]      = Неопределено;
		//		ИначеЕсли ЭлементыФормы.НастройкиИсточника.ТекущаяКолонка.Имя = "КорСчет" Тогда	
		//			ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ЗначениеКорСубконто" + Строка(а)] = Неопределено;
		//			ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ВидКорСубконто" + Строка(а)]      = Неопределено;
		//		КонецЕсли;
		//	КонецЦикла;
		//Иначе	
		//	Для Каждого видСубконто Из ВидыСубконто Цикл
		//		Если ЭлементыФормы.НастройкиИсточника.ТекущаяКолонка.Имя = "Счет" Тогда
		//			ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ВидСубконто"+ Строка(видСубконто.НомерСтроки)] = видСубконто.ВидСубконто;
		//			ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ЗначениеСубконто"+ Строка(видСубконто.НомерСтроки)] = ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ВидСубконто"+ Строка(видСубконто.НомерСтроки)].ТипЗначения.ПривестиЗначение(ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ЗначениеСубконто"+ Строка(видСубконто.НомерСтроки)]);
		//		ИначеЕсли ЭлементыФормы.НастройкиИсточника.ТекущаяКолонка.Имя = "КорСчет" Тогда	
		//			ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ВидКорСубконто"+ Строка(видСубконто.НомерСтроки)] = видСубконто.ВидСубконто;
		//			ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ЗначениеКорСубконто"+ Строка(видСубконто.НомерСтроки)] = ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ВидКорСубконто"+ Строка(видСубконто.НомерСтроки)].ТипЗначения.ПривестиЗначение(ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ЗначениеКорСубконто"+ Строка(видСубконто.НомерСтроки)]);
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	ПриИзмененииСчетаВНастройках(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КорСчетПриИзменении(Элемент)
	ПриИзмененииСчетаВНастройках(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСчетаВНастройках(Элемент)
	ОписаниеСчета = ПолучитьСвойстваСчета(Элементы.НастройкиПоРегиструБухгатерии.ТекущиеДанные[Элемент.Имя]);
	Если ОписаниеСчета.КоличествоСубконто = 0 Тогда
		Для а = 1 По 3 Цикл
			Если Элемент.Имя = "Счет" Тогда
				Элементы.НастройкиПоРегиструБухгатерии.ТекущиеДанные["Субконто" + Строка(а)] = Неопределено;
				//Элементы.НастройкиПоРегиструБухгатерии.ТекущиеДанные["ВидСубконто" + Строка(а)]      = Неопределено;
			ИначеЕсли Элементы.НастройкиИсточника.ТекущаяКолонка.Имя = "КорСчет" Тогда	
				Элементы.НастройкиПоРегиструБухгатерии.ТекущиеДанные["КорСубконто" + Строка(а)] = Неопределено;
				//ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ВидКорСубконто" + Строка(а)]      = Неопределено;
			КонецЕсли;
		КонецЦикла;
	Иначе	
		Для Сч = 1 По ОписаниеСчета.КоличествоСубконто Цикл
			СоставнойТип = ОписаниеСчета["ВидСубконто"+ Строка(Сч)+"ТипЗначения"].Типы().Количество() > 1;
			Если Элемент.Имя = "Счет" Тогда
//				Элементы.НастройкиПоРегиструБухгатерии.ТекущиеДанные["ВидСубконто"+ Строка(видСубконто.НомерСтроки)] = видСубконто.ВидСубконто;
				Элементы.НастройкиПоРегиструБухгатерии.ТекущиеДанные["Субконто"+ Строка(Сч)] = ОписаниеСчета["ВидСубконто"+ Строка(Сч)+"ТипЗначения"].ПривестиЗначение(Элементы.НастройкиПоРегиструБухгатерии.ТекущиеДанные["Субконто"+ Строка(Сч)]);
				Элементы["Субконто"+ Строка(Сч)].ВыбиратьТип = СоставнойТип;
			ИначеЕсли Элемент.Имя = "КорСчет" Тогда	
//				ЭлементыФормы.НастройкиИсточника.ТекущиеДанные["ВидКорСубконто"+ Строка(видСубконто.НомерСтроки)] = видСубконто.ВидСубконто;
				Элементы.НастройкиПоРегиструБухгатерии.ТекущиеДанные["КорСубконто"+ Строка(Сч)] = ОписаниеСчета["ВидСубконто"+ Строка(Сч)+"ТипЗначения"].ПривестиЗначение(Элементы.НастройкиПоРегиструБухгатерии.ТекущиеДанные["КорСубконто"+ Строка(Сч)]);
				Элементы["КорСубконто"+ Строка(Сч)].ВыбиратьТип = СоставнойТип;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСвойстваСчета1(Знач Счет)

	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("Ссылка"                         , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	ДанныеСчета.Вставить("Наименование"                   , "");
	ДанныеСчета.Вставить("Код"                            , "");
	ДанныеСчета.Вставить("КодБыстрогоВыбора"              , "");
	ДанныеСчета.Вставить("Родитель"                       , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	ДанныеСчета.Вставить("Вид"                            , Неопределено);
	ДанныеСчета.Вставить("Забалансовый"                   , Ложь);
	ДанныеСчета.Вставить("ЗапретитьИспользоватьВПроводках", Ложь);
	ДанныеСчета.Вставить("Валютный"                       , Ложь);
	ДанныеСчета.Вставить("Количественный"                 , Ложь);
	ДанныеСчета.Вставить("УчетПоПодразделениям"           , Ложь);
	ДанныеСчета.Вставить("НалоговыйУчет"                  , Ложь);
	ДанныеСчета.Вставить("КоличествоСубконто"             , 0);
	
	МаксКоличествоСубконто = юц_БухгалтерскийУчет.МаксимальноеКоличествоСубконто();
	
	Для ИндексСубконто = 1 По МаксКоличествоСубконто Цикл
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      Ложь);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", Ложь);
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		Возврат ДанныеСчета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", Счет);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка,
	|	Хозрасчетный.Родитель,
	|	Хозрасчетный.Код,
	|	Хозрасчетный.КодБыстрогоВыбора,
	|	Хозрасчетный.Наименование,
	|	Хозрасчетный.Вид,
	|	Хозрасчетный.Забалансовый,
	|	Хозрасчетный.ЗапретитьИспользоватьВПроводках,
	|	Хозрасчетный.Валютный,
	|	Хозрасчетный.Количественный,
	|	Хозрасчетный.УчетПоПодразделениям,
	|	Хозрасчетный.НалоговыйУчет
	|ИЗ
	|	ПланСчетов.уатРегламентированный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка = &Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.НомерСтроки КАК НомерСтроки,
	|	ХозрасчетныйВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.Наименование КАК Наименование,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.ТипЗначения КАК ТипЗначения,
	|	ХозрасчетныйВидыСубконто.ТолькоОбороты КАК ТолькоОбороты,
	|	ХозрасчетныйВидыСубконто.Суммовой КАК Суммовой
	|ИЗ
	|	ПланСчетов.уатРегламентированный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХозрасчетныйВидыСубконто.НомерСтроки";
	
	МассивРезультатов	= Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСчета, Выборка);
	КонецЕсли;
		
	ВыборкаВидыСубконто	= МассивРезультатов[1].Выбрать();
		
	ДанныеСчета.КоличествоСубконто	= ВыборкаВидыСубконто.Количество();
		
	ИндексСубконто	= 0;
		
	Пока ВыборкаВидыСубконто.Следующий() Цикл
		
		ИндексСубконто	= ИндексСубконто + 1;
		
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   ВыборкаВидыСубконто.ВидСубконто);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  ВыборкаВидыСубконто.Наименование);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   ВыборкаВидыСубконто.ТипЗначения);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      ВыборкаВидыСубконто.Суммовой);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", ВыборкаВидыСубконто.ТолькоОбороты);
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеСчета);
	
КонецФункции

&НаКлиенте
Процедура Субконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка)
КонецПроцедуры


&НаКлиенте
Процедура НачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		пМД = Элементы.НастройкиПоРегиструБухгатерии.ТекущиеДанные[Элемент.Имя].Метаданные(); 
		Если Метаданные.Справочники.Найти(пМД.Имя) <> Неопределено Тогда
			Если пМД.Владельцы.Количество() > 0 Тогда
				СтандартнаяОбработка = Ложь;
				вФорма = Справочники[пМД.Имя].ПолучитьформуВыбора(,Элемент);
				вФорма.РежимВыбора = Ложь;
				Если вФорма.ЭлементыФормы.СправочникСписок.Колонки.Найти("Владелец") <> Неопределено Тогда
					вФорма.ЭлементыФормы.СправочникСписок.Колонки.Владелец.Видимость = Истина;
				КонецЕсли;
				вФорма.Открыть();
				вФорма.РежимВыбора = Истина;
			КонецЕсли;	 
		КонецЕсли;   
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Субконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура Субконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура КорСубконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура КорСубконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура КорСубконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере1();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПередЗаписьюНаСервере1()
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти
